InformationRegisters/ОчередьДокументовДляОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОчередьДокументовДляОтправки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктураПараметровСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзменениеЗакупочныхЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьДокументовДляОтправки/Ext/ManagerModule.bsl
// Процедура добавляет запись для возможности повторной отправки
//
// Параметры:
//  <СтруктураПараметров>  - <Тип.Структура> - Структура параметров для алгоритмов отправки писем 
//
Процедура ДобавитьЗаписьДокументыДляОтправки(СтруктураПараметров) Экспорт
	
	
	МенеджерЗаписи = РегистрыСведений.ОчередьДокументовДляОтправки.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Документ       = СтруктураПараметров.ДокументСсылка;
	
	МенеджерЗаписи.ОписаниеОшибки = СтруктураПараметров.ОписаниеОшибки;
	
	МенеджерЗаписи.СтруктураПараметровСтрока = ЗначениеВСтрокуВнутр(СтруктураПараметров);	
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры // ОчиститьОтчередьДокументовДляОтправки()

// Процедура удаляет запись, если документ успешно отправлен 
//
// Параметры:
//  <ДокументСсылка>  - <Тип.ДокументСсылка - Ссылка на удаляемый документ
//
Процедура УдалитьЗаписьИзДокументыДляОтправки(ДокументСсылка) Экспорт

	  МенеджерЗаписи = РегистрыСведений.ОчередьДокументовДляОтправки.СоздатьМенеджерЗаписи();
	  
	  МенеджерЗаписи.Документ = ДокументСсылка;
	  
	  МенеджерЗаписи.Удалить();

КонецПроцедуры // ОчиститьОтчередьДокументовДляОтправки()

// Непосредственный запуск отправки письма
//
// Параметры:
//  <СтруктураПараметров>  - <Тип.Составной> - Структура параметров для алгоритмов отправки писем 
//                                          
Процедура ВыполнитьОтправкуПисьма(СтруктураПараметров) Экспорт

	Если ТипЗнч(СтруктураПараметров.ДокументСсылка) = Тип("ДокументСсылка.ИзменениеЗакупочныхЦен") Тогда
		
		Документы.ИзменениеЗакупочныхЦен.ОтправитьЗапросРуководителюНаИзменениеЦен(СтруктураПараметров);
		
		Если СтруктураПараметров.ОшибкаОтправки Тогда
			ДобавитьЗаписьДокументыДляОтправки(СтруктураПараметров);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры //ВыполнитьОтправкуПисьма
